Repository: B-Translator/old_btr_server
Catalog: modules/custom/btranslator_data/data/import/pingus/pingus-*.po
Languages: sq

source: As you have learned in earlier levels your Pingus can dig through basically any terrain, but there is one material which they can't penetrate: steel. These regions are marked dark grey on the level map and cannot be destroyed, so you must find a way around them.
sq: Siç e keni mësuar në nivelet e mëparshme, Pingusat mund të gërmojnë pothuajse çdo lloj trualli. Por është një material të cilin nuk mund ta depërtojnë: çeliku. Këto zona shënohen me gri të errët në hartën e nivelit dhe nuk mund të shkatërrohen, kështu që duhet të gjeni ndonjë mënyrë për ti anashkaluar.

source: One jump to catch them all
sq: Një hedhje për ti kapur të gjithë

source: The pingus have found themselves lost on their journey. What is this mysterious place? Smiling pumpkins, giant candlesticks, and some boiling soup below... what wizardry is this? Now, facing a deadly abyss right in front of them it's your job to save them. Can you save them from a terrible fate?
sq: Pingusat paskan humbur rrugën. Ç'është ky vend i mistershëm? Kunguj buzëqeshës, qirimbajtëse gjigande dhe një supë që vlon aty poshtë... çfarë magjie është kjo? Tani, me një greminë vdekjeprurëse mu përballë tyre, është detyra juaj që t'i shpëtoni. A mund t'i shpëtoni nga një fat i tmerrshëm?

source: One Thousand and One Jumps
sq: Një Mijë e Një Kërcime

source: With the exit so high above and far out of reach for a normal Pingu, what options are there? Perhaps a jumper can rescue them? Or will he simply slow their inevitable demise? It's your job to find out, but are you good enough to save them all?
sq: Ç'mund të bëhet, kur dalja është kaq lart dhe shumë larg mundësive të një Pingu normal për ta arritur? Ndoshta mund t'i shpëtojë një parashutist? Apo vetëm sa do ta vonojë fundin e tyre të pashmangshëm? Është detyra juaj që ta gjeni, por a jeni aq të zotë sa t'i shpëtoni që të gjithë?

source: Boom Boom
sq: Bum Bum

source: You've mastered the last challenge and now face the next. Their path to salvation seems to be cursed, but by whom? There is no time to think about it, since the next deadly challenge already awaits the Pingus. Two mighty roots block the way, but without a basher at hand to bash them away, sacrifice might be the only option...
sq: Mbizotëruat mbi sfidën e fundit dhe tani përballeni me tjetrën. Rruga e tyre për në shpëtim duket si e mallkuar, por nga kush? Nuk ka kohë të vrasësh mëndjen për këtë, pasi sfida tjetër vdekjeprurëse po i pret tashmë Pinguinët. Dy rrënjë të fuqishme bllokojnë rrugën, por pa një goditës që ti thyej, flijimi mund të jetë mundësia e vetme...

source: Full Circle
sq: Rreth i Plotë

source: The exit is so close, yet out of reach. A step in the wrong direction and the Pingus will fall to a terrible fate. You must do something to help them, but is there enough time? You have to hurry and can't allow yourself any mistakes. The Pingus are counting on you!
sq: Dalja është kaq afër, e megjithatë e pa arritshme. Një hap në drejtim të gabuar dhe Pingusat do të bien në një vdekje të tmerrshme. Duhet të bëni diçka për t'i ndihmuar ata, por a ka kohë të mjaftueshme? Duhet të nxitoni dhe nuk mund ti lejoni vetes gabime. Pingusat kanë besim te ju!

source: Bridgers Nightmare
sq: Makthi i Urave

source: Who placed this monstrous wall here? This terrible blockade separates your Pingus from the exit. Destruction of its awful construction seems an impossibility, but perhaps the bridger can come to the rescue? Can they build their bridges high enough to guide the group yet again safely to the exit? Or is somebody playing evil mind tricks with you? Yet again the solution is your call... your gray matter is the key to the Pingus' success, so don't let yourself get confused and misguided from the true path.
sq: Kush e ka vendosur këtë mur të stërmadh këtu? Ky bllokues i tmerrshëm i ndan Pingusat nga dalja. Shkatërrimi i tij duket gjë e pamundur, por a mund të na vijë në ndihmë ndërtuesi i urave? A mund t'i ndërtojnë urat në lartësinë e duhur për ta çuar edhe një herë grupin të sigurtë te dalja? Apo mos po ju punon kush ndonjë rreng të poshtër? E megjithatë zgjidhjen e vendosni ju... mendja juaj është çelësi për suksesin e Pingusave, kështu që mos e lejoni veten të hutohet dhe të largohet nga rruga e vërtetë.

source: Locked up by the witch
sq: Të kyçur nga shtriga

source: Is this a prison? Blocked by solid walls all around, there doesn't seem to be a way to escape. Salvation seems impossible. But wait... the wall to the right seems weak... perhaps this is a way to escape? Or is it a false path that will lead to the Pingus' doom? This is a risky trip, but you must take it to find out how to bring them all to freedom once again.
sq: A është ky një burg? Rrethuar me mure të forta në çdo anë, nuk duket se ka ndonjë rrugë për të dalë. Shpëtimi duket i pamundur. Prit pak... muri në të djathtë duket pak i dobët... ndoshta kjo është një rrugëdalje? Apo nuk është veçse një rrugë e gabuar që do ti çojë pinguinët në fatkeqësi? Është udhëtim i rrezikshëm, por duhet ta bëni për të gjetur se si ti nxirrni që të gjithë edhe njëherë në liri.

source: Splatterfest
sq: Spërkatje për qejf

source: This is by far the deepest pit the Pingus have yet encountered. Building a bridge across it seems obvious but that won't help since the exit is deep down in the pit itself. Pingus who try to go down the pit will just end up splattered all over the ground. You have two groups of Pingus at your disposal, can you make them work together to reach even an exit this well hidden?
sq: Ky është pa fjalë pusi më i thellë që Pingusat kanë hasur ndonjëherë. Mund të ndërtosh mbi të një urë fare thjeshtë, por kjo nuk bën dobi meqë dalja është thellë poshtë brenda pusit vetë. Pingusat që mund të provojnë të shkojnë poshtë në pus do të përfundojnë të zgërlaqur përtokë. Ju keni dy grupe Pingusash nën drejtim, a mund ti bëni që të punojnë bashkërisht për të arritur edhe te një dalje kaq mirë e fshehur?

source: Staircase Maintenance
sq: Mirëmbajtja e Shkallës

source: It seems we are up again against a mighty wall, and it is blocking the exit! But wait, some good soul has built a staircase around it. It seems, however, that the poor fool's efforts didn't last long, as the staircase is destroyed and full of holes. Can you fix it and make it over the wall? Yet of course you know that the right solution might not be the obvious one. But your Pingus are almost free, and they trust in your skill to guide them to safety once more. Succeed and you will have freed them once and for all from whatever evildoer that placed them in this nightmare... at least for this year.
sq: Duket se përsëri ndodhemi përballë një muri të fuqishëm, që na pengon daljen! Por prit pak, disa zemërmirë kanë ndërtuar një shkallare rreth tij. Megjithatë, duket se përpjekjet e të shkretëve nuk kanë zgjatur shumë, sepse shkallarja është e shkatërruar dhe plot me boshllëqe. A mund ta riparoni dhe të kaloni murin? Por natyrisht që ju e dini se zgjidhja e duhur ndoshta nuk është ajo që duket qartë. E megjithatë, Pingusat tuaj janë pothuajse të lirë dhe kanë besim në aftësinë tuaj për ti udhëhequr edhe njëherë drejt sigurisë. Arrijeni këtë dhe do ti keni çliruar njëherë e përgjithmonë nga cilido keqbërës që i ka futur në këtë ankth... të paktën për këtë vit.

source: Down Into The Cave
sq: Poshtë Në Shpellë

source: The exit is far below and the pingus are separated from it by quite a distance. The path down is riddled with gulfs, so jumping and bridging will be the primary tool to get down there. But be careful, the last few steps require some extra cleverness.
sq: Dalja eshte poshte fare dhe pingusat ndodhen goxha larg prej saj. Rruga poshte eshte shoshe me carje te vogla, keshtu qe kercimi dhe ndertimi i urave do te jene veglat kryesore per te zbritur atje. Por kini kujdes, ne hapat e fundit do tju duhet pak me teper mencuri.

source: Round and Round
sq: Rreth e Rrotull

source: Trapped in an eternal loop one brave pingu has to break out and go on a journey in search for the exit, but he mustn't be too happy once he found it, as there is still one last challenge he must solve before being allowed to enter it, otherwise all his friends might perish.
sq: I mbërthyer në një lak të përhershëm, një pingu trimosh duhet të arratiset dhe të niset në një udhëtim në kërkim të daljes. Por nuk duhet të jetë shumë i lumtur pasi ta ketë gjetur, sepse ka akoma një sfidë të fundit për të zgjidhur përpara se të lejohet të hyjë në të, përndryshe të gjithë shokët e tij mund të zhduken.

source: Red Herring Cave
sq: Shpella e Cironkave

source: The exit is right above the pingus heads, with a few friendly arrows pointing the way. With jumpers around the solution should be obvious. But wait, can anything you find in a dark cave be trusted or is there some more going on which might slip your view? Thinking outside the box might be required.
sq: Dalja është mu sipër kokave të pingusve, me disa shigjeta miqësore që tregojnë drejtimin. Duke pasur kërcyesa zgjidhja duhet të jetë e qartë. Por prit pak, a mund t'i besoni çdo gjëje që gjeni në një zgavër të errët, apo ka diçka më tepër që mund t'ju rrëshqasë pamjen? Mund t'ju duhet të mendoni ndryshe nga zakonisht.

source: Group Coordination
sq: Bashkërendim Grupi

source: Three groups are on their way to the exit, one of them trapped right above it, but locked into a box. None of them can make it alone, coordinate them wisely and everybody should be able to make it safely to the exit.
sq: Tre grupe janë rrugës për në dalje, njëri prej tyre i kapur sipër saj, i mbyllur në një kuti. Asnjë prej tyre nuk mund tia dalë i vetëm, bashkërendoji me zgjuarsi dhe të gjithë do të mund të shkojnë të sigurtë te dalja.

source: Traps, Dangers and other Problems
sq: Kurthe, Rreziqe dhe Probleme të tjera

source: The path to the exit lays below, shimmering through the planks. But the fall is too high, deadly for sure. Can one pingu alone make it's way through the dangerous traps and secure the path to the exit?
sq: Rruga për te dalja shtrihet poshtë, duke u shfaqur përmes dërrasave. Por rënia është shumë e lartë, me siguri vdekjeprurëse. A mundet një pingu i vetëm të kalojë përmes kurtheve të rrezikshme dhe të sigurojë rrugën për te dalja?

source: Reach that Switch
sq: Mbërrije atë Çelës

source: The path to the exit is straight, flat and simple, but wait a solid door blocking the way? How can the pingus open it? Is that a switch there on the hill to the right? Might that be the solution to opening the door and freeing the pingus? But how can they reach that switch?
sq: Rruga drejt daljes është e drejtë, e sheshtë dhe e thjeshtë. Por prit pak, rrugën e pengoka një derë e pathyeshme? Si mund ta hapin atë pingusat? A është çelës ai aty në kodrinën djathtas? A mos vallë është kjo zgjidhja për të hapur derën dhe për të çliruar pingusat? Por si mund ta arrijnë pingusat këtë çelës?

source: The Collapsed Column
sq: Shtylla e Shembur

source: High up above the green slime the pingus are moving from column to column, getting closer to the exit with each step, but wait, there is a second group of pingus, they are stuck. The column next to them has collapsed making getting to the exit impossible. Can you find a way around the abyss?
sq: Lart sipër llucës jeshile pingusat po lëvizin nga shtylla në shtyllë, duke ju afruar daljes në çdo hap, por prit, është një grup i dytë pingusash, ata kanë ngecur. Shtylla pranë tyre është shembur duke e bërë vajtjen te dalja të pamundur. A mund të gjeni ndonjë rrugë për ta shmangur greminën?

source: Island of Doom
sq: Ishulli i Dënimit

source: The pingus are released close together, but split up by a solid metal column with seemingly no way to join them back up. The journey will be dangerous and some height has be crossed with the exit hidden below. With some cleverness it should be possible to join those two groups back together.
sq: Pingusat lëshohen pranë e pranë, por ndahen nga një kolonë e fortë metalike dhe duket se nuk mund të bashkohen më përsëri.Udhëtimi do të jetë i rrezikshëm dhe duhet të kapërcehen disa lartësi, me daljen të fshehur poshtë. Me pak zgjuarsi duhet të jetë e mundur të bëhen bashkë të dyja grupet prapë.

source: Tower of Death
sq: Kulla e Vdekjes

source: The pingus are at the top of the tower, with no stairway around. The exit is deep down, hidden at the foot of the tower. How shall they make it down all that height with no floaters sight? A few well placed diggers should be enough to get the job done, but wait, no, their direction isn't quite right. You have to give them directions or it will be their doom.
sq: Pinguinët janë në majë të kullës, pa shkallë për të zbritur. Dalja është poshtë fare, e fshehur në fund të kullës. Si do t'ia bëjnë për të zbritur nga gjithë ajo lartësi, pa këmbë parashutisti gjëkundi? Disa gërmues në vendet e duhura mund të mjaftojnë për ta kryer punën, por prit pak, jo, drejtimi i tyre nuk është fort në rregull. Ju duhet ti udhëzoni ata ose ka për të qenë fundi i tyre.

source: The Ones
sq: Njëshat

source: This is the last stage the pingus have to pass during this Halloween. Two oddly familiar column are in the way. What do they mean? The two groups of pingus have to work together to make it down the columns to the exit far below.
sq: Kjo është faza e fundit që pingusat duhet të kalojnë gjatë kësaj Dite të Shënjtorëve (Halloween). Dy kolona çuditërisht të njohura janë në mes të rrugës. Çfarë kuptimi kanë? Dy grupet e pingusve duhet të punojnë bashkarisht që të kalojnë kolonat dhe të shkojnë poshtë në dalje.

source: Down the valley and up again
sq: Poshtë luginës dhe ngjitu prapë

source: There is a large valley between the entrance and the exit. No bridge will be long enough to cross the valley, but can you find a way back up once you lead the Pingus down into the valley?
sq: Midis hyrjes dhe daljes ndodhet një luginë e madhe. Asnjë urë nuk mund të jetë aq e gjatë sa të kalojë luginën. Por a mund të gjeni ndonjë mënyrë për tu ngjitur prapë pasi t'i keni çuar Pingusat poshtë në luginë?

source: Entering the pyramid
sq: Hyrja në piramidë

source: After their long and dangerous journey through the desert the Pingus finally reach the large pyramid, but there is still a pedestal blocking their way.
sq: Pas udhëtimit të gjatë dhe të vështirë përmes shkretëtirës, Pinguinët më në fund arritën piramidën e madhe, por ka akoma një bllok që u pengon rrugën.

source: The window room
sq: Dhoma dritare

source: After the Pingus have entered the pyramid, they reach a large room with a large window. The only problem they have is that the entrance to the room is much too high to survive the landing. Can you help them?
sq: Pasi Pingusat kanë hyrë në piramidë, ata arrijnë tek një dhomë e madhe me dritare të gjera. Problemi i vetëm që kanë është se hyrja për tek dhoma është pak si shumë e lartë për t'u hedhur pa u vrarë. A mund t'i ndihmoni?

source: Grand Hall
sq: Salla e Madhe

source: The pingus have found themselves in the grand hall, a hall full of wonder and treasures. The exit however is high up and won't be easy to reach. Guide the pingus around the hall and maybe you will find a way.
sq: Pingusat e kanë gjetur veten në sallën e madhe, një sallë plotë me çudi dhe thesare. E megjithatë dalja ndodhet sipër dhe nuk mund të arrihet kollaj. Udhëhiqi pingusat përqark sallës dhe ndoshta do të gjeni ndonjë rrugë.

source: Pass the pedestal
sq: Kaloni piedestalin

source: A large pedestal is blocking the way to the exit and there aren't enough bashers available to dig it away. Can you find a way to make it past the pedestal?
sq: Një bllok i madh e pengon rrugën për në dalje dhe nuk ka goditës të mjaftueshëm për ta çarë atë. A mund të gjeni ndonjë rrugë për ta kaluar bllokun?

source: The excavation of the pyramid
sq: Gërmimi i piramidës

source: The excavations are open to reach the pyramid for his redeeming content. Some excavations, however, is best done with two competitors. Who comes first?
sq: Gërmimet kanë filluar për të arritur piramidën për përmbajtjen e saj shpërblyese. Disa gërmime, megjithatë, bëhen më mirë me dy konkurentë. Kush do të dalë i pari?

source: Catch them at the half way point
sq: Kapi në mes të rrugës

source: The Pingus are separated from the exit by large abyss. A simple bridge won't be enough to catch them safely, unless of course you find the right place to put it. Can you uncover that spot?
sq: Pingusat i ndan nga dalja një humnerë e gjerë. Një urë e thjeshtë nuk do të ishte e mjaftueshme për ti kaluar me siguri, veç nëse do të gjenit vendin e duhur për ta vendosur. A mund ta zbuloni atë pikë?

source: Claustrophobia
sq: Frymëzënie

source: Hidden deep below the pyramid the pingus come across a small underground room, but unfortunatley a large tree root blocks their path...
sq: Të fshehur thellë nën piramidë pinguinët hasin një dhomë të vogël nëntokësore, por fatkeqësisht një rrënje e madhe peme ka bllokuar shtegun e tyre...

source: A bit to the right a bit to left
sq: Sa majtas djathtas

source: Only the most audacious Pingus will be allowed to continue.
sq: Vetëm më guximtarët do lejohen të kalojnë.

source: 25 Pingus free and 25 in the box
sq: 25 Pingu të lirë dhe 25 në kuti

source: Okay for the Bridger but what can I do with Digger? You should save at least one Pingu trapped in the box above the exit.
sq: Në rregull Urëndërtuesi por çfarë mund të bëj me Gërmuesin? Duhet të shpëtoni të paktën një Pingu të bllokuar në kutinë sipër daljes.

source: Tunnel Time
sq: Kohë Tuneli

source: Dig a tunnel and you might make it to the exit. Digger and miners and stuff have to work together.
sq: Gërmo një tunel dhe mund t'ia mbërrish te dalja. Gërmuesi dhe minuesi dhe gjërat e tjera duhet të punojnë së bashku.

source: Crawlspace
sq: Hapësirë e zvarritjes

source: The path to the exit is blocked and many small tunnels lead the way, but be careful some of those lead to certain death. Or is there something you can do about that and create a save passage for all the Pingus and lead them safely to the exit?
sq: Rruga e daljes është e zënë dhe ka shumë tunele të vogla. Por kujdes, disa prej tyre të çojnë në vdekje të sigurt. Apo mund të bëni diçka që të krijoni një kalim të sigurt për të gjithë Pingusat dhe ti çoni shëndosh e mirë deri në dalje?

source: The Roof
sq: Çatia

source: Sometimes the roofs are not good for refuge, sometimes it should be demolished! But be careful if you aren't precise enough, you might lead the Pingus straight to certain death.
sq: Ndonjëherë çatitë nuk janë të mira për strehim, ndonjëherë duhen shembur! Por bëni kujdes, nëse nuk jeni të saktë sa duhet, mund t'i çoni Pingusat drejt e në vdekje të sigurtë.

source: Pingus Jones and the Last Exit
sq: Pingus Jones dhe Dalja e Fundit

source: Dr. Jones' notebook: (1) the breath of God: only the penitent pingus will pass; (2) the word of God... in reverse; (3) the path of God: leap from the head of something like a cat.
sq: Libri i shënimeve i Dr. Xhonsit (Jones): (1) fryma e Zotit: vetëm pinguinët e penduar do kalojnë; (2) fjala e Zotit... mbrapsht; (3) rruga e Zotit: hidhu nga koka e diçkaje si një mace.

source: Near can mean far
sq: Afër mund të ketë kuptimin larg

source: What do you do when you're going in the wrong direction ? Simple: walk into a wall. But it is easier said than done...
sq: Si i bëhet kur po shkoni në drejtim të gauar? E thjeshtë: ecni në një mur. Por është kollaj ta thuash dhe vështirë ta bësh...

source: Trapped Underground
sq: Bllokuar Nëntokë

source: The penguins escaped the mad scientist, but now they were trapped deep underground. They had no food or water, so they had to move fast.
sq: Pinguinët shpëtuan nga shkencëtari i çmendur, por tani janë bllokuar thellë nëntoke. Nuk kanë ushqime apo ujë, kështu që duhet të lëvizin shpejt.

source: Experimentation
sq: Eksperimentim

source: A mad scientist has captured the penguins and is experimenting on them. How can the penguins escape the guillotine?
sq: Një shkencëtar i shkarë ka kapur pinguinët dhe po bën eksperimente me ta. Si mund të shpëtojnë pinguinët nga tortura?

source: Hall of Illusion
sq: Salla e Vegimeve

source: The penguins stopped and stood in indecision. What was real and what was not? Flame lanced from above and a guillotine glittered in the distance. Almost all penguins must survive.
sq: Pinguinët u ndalën dhe qëndruan të pavendosur. Çfarë ishte e vërtetë dhe çfarë jo? Nga lart lëshoheshin flakë dhe në largësi shkëlqente një teh prerës. Gati të gjithë pinguinët duhet të shpëtojnë.

source: The Lava Pit
sq: Gropa e llavës

source: The penguins had defeated the mad scientist, and were walking away from his destroyed laboratory when a huge hole opened under their feet. The penguins fell into an underground cave and the only way out was across the lava pit. Luckily, it seemed someone had left some helpful signs.
sq: Pinguinët kishin mposhtur shkencëtarin e çmendur dhe po largoheshin nga laboratori i tij i shkatërruar, kur një gropë e madhe u hap nën këmbët e tyre. Pinguinët ranë në një shpellë të nëndheshme dhe e vetmja rrugë për të dalë ishte përmes pellgaçes me llavë. Për fat të mirë, dikush mesa duket kishte lënë disa shenja të dobishme.

source: At least the experiments are over...
sq: Të paktën eksperimentet mbaruan...

source: The good news was that the mad scientist had tired of his experiments, the bad news was that now he was dumping them down a pit. A single floatation device was all the penguins had. Save as many as possible.
sq: Lajmi i mirë ishte që shkencëtari i marrë ishte lodhur me eksperimentet e tij. Lajmi i keq ishte që tani po i hidhte në një gropë. Një pajisje lundrimi e vetme ishte gjthëçka që pinguinët kishin. Shpëto sa më shumë që të jetë e mundur.

source: Ghosting
sq: Ndjekje si hije

source: The penguins came to a long pass. Acid bubbled underneath and it seemed a climber or two were needed. Hint: slider can be used to stop the miner ability.
sq: Pinguinët erdhën tek një kalim i gjatë. Acid gurgullues poshtë dhe duket se nevojiten njady ngjitës. Ndihmë: rrëshqitësi mund të përdoret për të ndalur aftësinë e minatorëve.

source: The Final (and suprisingly easy) Challenge
sq: Sfida Përfundimtare ( dhe befasisht e lehtë)

source: The penguins had reached the end of the island. In the water was a long tree, perfect for the penguin's needs. Their journey was almost over.
sq: Pinguinët kishin arritur tek fundi i ishullit. Në ujë ishte një pemë e gjatë, e përkryer për nevojat e pinguinëve. Udhëtimi i tyre pothuajse kishte përfunduar.

source: Revenge is sweet
sq: Hakmarrja është e ëmbël

source: The penguins had escaped the mad scientist but now they wanted revenge. They intended to destroy the support structures, sending the evil laboratory crashing down.
sq: Pinguinët i kishin shpëtuar shkencëtarit të marrë por tani donin të hakmerreshin. Ata donin të shkatërronin strukturat mbajtëse, në mënyrë që laboratori i poshtër të shembej.

source: The penguins had escaped the mad scientist but now they wanted revenge. They intended to destroy the support structures, sending the evil laboratory crashing down. They had to move fast though, because the mad scientist would detect and recapture them if they weren't fast enough.
sq: Pinguinët i kishin shpëtuar shkencëtarit të çmendur por tani donin hakmarrje. Ata synonin të shkatërronin strukturat mbështetëse, duke e shembur përtokë laboratorin djallëzor. Megjithatë duhet të veprojnë shpejt, sepse shkencëtari i çmendur mund ti pikasë dhe ti kap përsëri nëse nuk janë të shpejtë sa duhet.

source: Winter Wonderland
sq: Magjepsje Dimërore
