Repository: B-Translator/old_btr_server
Catalog: modules/custom/btranslator_data/data/import/pingus/pingus-*.po
Languages: sq

source: After getting past the lava pit, the penguins walked and walked until they reached a snowed in exit. That would be relatively easy to tunnel through but how would it be possible to tunnel through solid metal?
sq: Pasi kaluan gropën me llavë, pinguinët ecën e ecën deri sa arritën një dalje të mbuluar nga bora. Do kishte qenë e lehtë të hapej një tunel por si mund të hapësh një tunel përmes metalit të fortë?

source: The Journey Goes On
sq: Udhëtimi Vazhdon

source: And so the penguins continued on their journey, drawing ever closer to the North Pole. They had escaped the guillotine, defeated the mad scientist and got a new boat. And so this chapter in their voyage was over, but there would be other obstacles. Nothing would stop the determined penguins from reaching their goal.
sq: Dhe kështu pinguinët vazhduan udhëtimin e tyre, duke iu afruar gjithmonë e më tepër Polit të Veriut. Ata i kishin shpëtuar gijotinës, kishin mposhtur shkencëtarin e çmendur, dhe kishin marrë një barkë të re. Kështu, ky kapitull në udhëtimin e tyre kishte mbaruar, por do të kishte pengesa të tjera. Asgjë nuk do ti pengonte pinguinët e vendosur që të arrinin qëllimin e tyre.

source: Think fast (literally)
sq: Mendo shpejt (vërtet)

source: This would be simple but for one thing, there are no blockers. All the penguins must survive.
sq: Ky nivel do të ishte i thjeshtë veçse për një gjë: nuk ka ndaluesa. Të gjithë pinguinët duhet të shpëtojnë.

source: Shipwrecked
sq: Anijembytur

source: The penguins were sailing along happily on their makeshift boat until suddenly an island appeared. The penguins were drawn towards it and crashed, destroying their boat. Now they must find their way across this strange island.
sq: Pinguinët po vazhdonin lundrimin për bukuri në barkën e tyre të sajuar, kur papritur u shfaq një ishull. Pinguinët i çoi rryma drejt tij dhe u përplasën, dhe kështu e shkatërruan lundrën. Tani ata duhet të gjejnë rrugën përmes këtij ishulli të çuditshëm.

source: Escape from Aliens
sq: Shpëto, ik nga Jashtëtokësorët

source: Aliens invade our starship blocking entrance to the teleporter. Your crew is well trained, like you they don't panic.
sq: Të huajt pushtojnë anijen tonë yjore dhe zënë hyrjen për te mbartësi valor. Ekipi juaj është i stërvitur mirë, ashtu si ju ata nuk lemerisen.

source: Escape from Aliens 2
sq: Arratisje nga të Huajt 2

source: Aliens are now closest making your escape harder. You must dig it up.
sq: Alienët tani janë shumë afër, duke e vështirësuar largimin. Duhet të gërmosh sipër.

source: Alien's nest
sq: Strofulla e alienëve

source: Pingus invade the nest. Take care of jaws. What's the matrix above?
sq: Pingusat pushtojnë folenë. Kini kujdes nofullat. Ç'është matrica sipër?

source: Matrix of the death
sq: Matrica e vdekjes

source: Take a piece of paper. Now pingus have to enter the matrix of the death. This is a maze, bad ways are protect by jaws.
sq: Merr një fletë letër. Tani pinguinët duhet të hyjnë në matricën e vdekjes. Ky është një labirint, rrugët e këqija mbrohen nga nofulla.

source: Spy's pingus in the matrix of the death
sq: Pingusi i spiunit në matricën e vdekjes.

source: Spy's pingus have marked the location of jaws in the matrix of the death. Many died to gain that information :..( Perhaps this help. Perhaps...
sq: Pinguinë zbulues kanë shënuar vendodhjen e nofullave në matricën e vdekjes. Shumë prej tyre kanë vdekur për të mbledhur këto informata :..( Ndoshta kjo ju ndihmon. Ndoshta...

source: Fourth dimension
sq: Përmasa e katërt

source: The defenses of the aliens get stronger. Now you have to jump in the fourth dimension to win!
sq: Mbrojtja e të huajve është bërë më e fortë. Tani ju duhet të kërceni në dimensionin e katërt që të fitoni!

source: Set your watches
sq: Vendosni orët

source: Cooperation in space.
sq: Bashkëpunim në hapësirë.

source: Lost in Space
sq: Humbur në Hapësirë

source: We don't know where we are but we don't leave anybody behind.
sq: Nuk e dimë se ku jemi, por nuk lëmë asnjë mbrapa.

source: Outside In
sq: Mbrapsht

source: Can you help the pingus escape without getting their flippers wet?
sq: A mund ti ndihmoni pinguinët të shpëtojnë, pa i lagur këmbët?

source: Endless Loop
sq: Rrotullim Pambarim

source: To the right and to the left the Pingus will face certain death and you have to save 50. Can you help them get out of this mess?
sq: Në të djathtë dhe në të majtë Pingusat do të përballen me vdekje të sigurtë dhe ju duhet të shpëtoni 50. A mund t'i ndihmoni të dalin nga ky telash?

source: Up up in the space
sq: Ngjitje lart në hapësirë

source: What good is a pick in space? Certainly not to go to the stars.
sq: Përse shërben një vjelje në hapësirë? Sigurisht jo për të shkuar te yjet.

source: Jump
sq: Hidhu

source: All Pingus need is to jump.... Hint: While pausing (press P key) you still can control Pingus.
sq: Hedhja është ajo që u duhet Pingusve.... Shenjë: Mund ti kontrolloni Pingusat edhe gjatë ndalesës me çelësin P.

source: Factory
sq: Fabrikë

source: Finally you reached the factory. Watch out as there are many dangers. Use bombers to destroy the basement of the factory. Good luck!
sq: Më në fund arrite fabrikën. Hap sytë se ka shumë rreziqe. Përdor bombarduesit për të shkatëruar bodrumet e fabrikës. Paç fat!

source: Going back home
sq: Kthimi në shtëpi

source: Your mission is over. Pingus can go back home, but be careful!
sq: Misioni juaj ka përfunduar. Pingusat mund të kthehen në shtëpi, por bëni kujdes!

source: Bonus track
sq: Udhë shtesë

source: Pingus are at home, but after the climate change living on the South Pole became more dangerous. There is one more mission for you.
sq: Pingusat janë në shtëpi, por pas ndryshimit të klimës jetesa në Polin e Jugut u bë më me rrezik. Keni edhe një detyrë tjetër.

source: Falling down
sq: Duke rënë

source: Pingus intelligence reported that a huge factory located in the subtropical zone might be a reason of a climate change. They decided to go there and shut down the factories. This will be a long and dangerous expedition. Pingus and you will have to face many difficulties on your way. As the ice is melting, at first you have to build some bridges and watch out for the cliff.
sq: Inteligjenca pinguistike raportoi se arsyeja për ndryshimet klimatike mund të ishte një fabrikë shumë e madhe që ndodhej në zonën nën-tropikale. Ata vendosen të shkonin atje dhe t'i mbyllnin fabrikat. Kjo do të jetë një ekspeditë e gjatë dhe e rrezikshme. Ti dhe pingusat do të kaloni shumë vështirësi gjatë rrugës. Ndërkohë që akulli shkrin, në fillim do ju duhet të ndërtoni disa ura dhe gjithashtu të shihni se mos del ndonjë shkëmb.

source: Destination North
sq: Drejt Veriut

source: For now, Pingus are leaving South Pole and moving North. You have to help them!
sq: Për momentin, Pingus janë duke u larguar nga Poli i Jugut dhe po shkojnë drejt Polit të Veriut. Ju duhet t'i ndihmoni ata!

source: The Cave
sq: Shpella

source: Pingus on their way came across a huge cave. You have to lead them through. Remember that sometimes there is more than one way out. Hint: To 'unlock' blockers you can use bashers and jumpers.
sq: Gjatë rrugës pingusat hasën një shpellë të madhe. Ju duhet t'i drejtoni nëpër të. Mos harroni se ndonjëherë ka më shumë se një rrugë për të dalë. Udhëzim: Për të 'hapur' penguesit mund të përdorni goditësit dhe kërcyesit.

source: Difficulties on the way
sq: Vështirësi në rrugë

source: It looks you have encountered serious difficulties. But don't panic, Pingus are waiting for your orders, they count on you so don't fail! Hint: Miners, diggers and bashers are very important here!
sq: Duket se keni hasur në vështirësi serioze, por mos u alarmo. Pinguinët po presin për urdhërat tuaja. Ata kanë besim te ju, kështu që mos e humbni! Udhëzim: Minuesit, gërmuesit dhe thyesit janë shumë të rëndësishëm këtu!

source: Four ways out
sq: Katër mënyra për të dalë

source: It's getting warmer but Pingus are bravely moving North. This time it will be much easier. There are at least four ways out. Could you find them?
sq: Po bëhet më ngrohtë, por Pingusat shkojnë me guxim për në Veri. Këtë herë do të jetë shumë më lehtë. Ka të paktën katër mënyra për të shpëtuar. A mund t'i gjeni ato?

source: Egypt - So easy
sq: Egjipti - Sa lehtë

source: Pingus reached Egypt. Looks easy, but is it really so easy? Try it out.
sq: Pinguinët arritën Egjiptin. Duket e lehtë, por a është vërtetë kaq e lehtë? Provoje.

source: Egypt - Oasis
sq: Egjipt - Oaz

source: Last time it was easy. Now it will be a little bit harder. Pingus are entering oasis. Watch out for the water.
sq: Herën e fundit ishte lehtë. Tani do të jetë pak më vështirë. Pingusat po hyjnë në vendburim. Kujdes nga uji.

source: Egypt - The Maze
sq: Egjipt - Labirint

source: You came across a maze. Can you find the way out? Think twice before digging.
sq: Ju erdhët në një labirint. A mund ta gjeni rrugën për të dal? Mendo dy herë para se të gërmosh.

source: Egypt - Pyramids
sq: Egjipt - Piramidat

source: The maze led you to the big pyramids. Now you have 4 minutes to escape. Hurry up!
sq: Labirinthi ju solli te piramidat e mëdhaja. Tash i ke 4 minuta për të ikur. Shpejto!

source: Bomb and Double Catch
sq: Bombardim dhe Kapje Dyshe

source: Here you might have some time to relax. The path isn't complicated and a bit of bombing and catching of Pingus should bring you to the end without much trouble, but don't relax to much, your resources are limited, so be careful when using them.
sq: Këtu mund të keni pak kohë për tu qetësuar. Rruga nuk është e ndërlikuar, dhe mjaftojnë ca bombardime dhe pak nxitim që Pingusat të arrijnë deri në fund pa shumë mundim. Por mos u shlodh shumë, rezervat i ke të kufizuara, kështuqë përdori me kujdes.

source: Up, Up and Away
sq: Lart, Lart dhe Larg

source: The exit is in a weird spot here, straight above. A bridge won't get you there, but your toolset allows an alternative way. Can you figure it out?
sq: Dalja këtu është në një pikë të çuditshme, drejt e sipër. Me urë nuk e arrini dot, por mjetet e punës ju lejojnë një mënyrë tjetër. E gjeni dot se si?

source: If only penguins could fly
sq: Ah sikur pinguinët të mund të fluturonin

source: Bridges are kind of rare around here, so don't waste any. That aside, you shouldn't have to much trouble here, everything to do here you should have learned, but you might have to use all that knowledge at once.
sq: Urat janë pak si të rralla këndej rrotull, kështu që mos i bëni dëm kot. Po ta lëmë këtë mënjanë, s'duhet të keni tepër andralla këtu. Çdo gjë që duhet bërë duhet ta keni mësuar tashmë, por ndoshta mund t'ju duhet ti përdorni të gjitha ato që dini njëherësh.

source: Stairway to Heaven
sq: Shkallët për Parajsë

source: Here things start to get a little complicated. Getting up to the exit is hard enough with a single Pingu, but with all of them? Impossible! But wait, who says they have to come the same way?
sq: Këtu gjërat fillojnë të bëhen pak të ndërlikuara. Të mbërrish daljen është mjaft e vështirë me një Pingu të vetëm, por me të gjithë ata? E pamundur! Por prit, kush thotë që ata duhet të vijnë nga e njëjta rrugë?

source: Misdirection Everywhere
sq: Keqdrejtim Gjithandej

source: The last level for this Xmas. Looks a little complicated, right? Don't worry with all you have learned so far, you should be able to even solve this. Good Luck & a Merry Xmas 2011
sq: Niveli i fundit për këtë vit. Duket pak i koklavitur, apo jo? Mos u shqetësoni, me gjithë ato që keni mësuar deri tani, duhet të jeni në gjendje ta zgjidhni edhe këtë. Paç Fat dhe Gëzuar Vitin e Ri.

source: The Big Jump
sq: Kërcimi i Madh

source: Going in and out of the abyss with all Pingus isn't an option here, but a small group preparing the path for the others should get you across.
sq: Të hysh në greminë dhe të dalësh prej saj me të gjithë Pingusat nuk është punë që bëhet, por një grup i vogël mund të përgatisë rrugën për të tjerët.

source: No Way to Stop
sq: S'ka Mënyrë për të Ndaluar

source: Here you don't have much time to waste. The path to the exit is clear and straight, but you don't have the time to prepare it. Can you find a way to leap ahead?
sq: Këtu nuk keni mjaft kohë për të humbur. Shtegu për në dalje është i qartë dhe i drejtë, por ju nuk keni kohë për ta përgatitur. A mund të gjeni ndonjë mënyrën për tu hedhur përpara?

source: Ice Block Blockage
sq: Pengesë prej Akulli

source: What's this? A gigantic ice block straight in the path? Where did that come from? No time wondering about things like that. The Pingus need to get to the exist and it's your job to find a way around the block.
sq: Ç'është kështu? Një shkëmb gjigant akulli mu në rrugë? Nga doli ky? S'ka kohë për të vrarë mendjen për gjëra të tilla. Pingusat duhet të shkojnë te dalja, dhe ti ke për detyrë tu gjesh një mënyrë për të anashkaluar shkëmbin.

source: The Impossible Bridge
sq: Ura e Pamundshme

source: Two groups of Pingus separated by a deep byss, joining them by a bridge seems impossible, but wise coordination of the two groups and a brave leap should let you make it to the exit.
sq: Dy grupe Pingusash të ndara nga një greminë e thellë. Bashkimi i tyre me anë të një ure duket i pamundur. Por me një bashkërendim të zgjuar të të dy grupeve dhe me një kërcim i guximshëm ju mund ta arrini daljen.

source: Spiraling Away
sq: Largim Rrotullues

source: The exit is straight below, but the path is blocked by solid steal with no way through. But the Pingus have a versatile toolset at hand, can you use it to find a way around and make it to the exit?
sq: Dalja është drejt e poshtë, por shtegu është i bllokuar me çelik të fortë pa mundësi depërtimi. Por Pingusat kanë një komplet me vegla të larmishme në duar, a mund ti përdorni ato për të gjetur një rrugë dhe për ti dërguar tek dalja?

source: Tutorial Island
sq: Ishulli i Praktikës

source: Learn the basics
sq: Mëso gjërat themelore

source: Watch Ending
sq: Shiko Përfundimin

source: Watch Intro
sq: Shiko Hyrjen

source: The Journey Begins
sq: Udhëtimi Fillon

source: For a long time, the Pingus have lived happily in peace on the South Pole along with all the other animals. Everything was in balance and it seemed like nothing could disrupt their peace. The Pingus were happy and it seemed like this could never end.
sq: Për një kohë të gjatë, Pingusat kishin jetuar lumturisht në paqe në Polin e Jugut bashkë me gjthë kafshët e tjera. Çdo gjë ishte në drejtpeshim dhe dukej se asgjë nuk mund ta prishte paqen e tyre. Pingusat ishin të lumtur dhe dukej se kjo do të vazhdonte përgjithmonë.

source: But then one day, things began to change slowly: the sky got darker and the earth got warmer. Firstly, they thought this was just a normal fluctuation in the world's climate, but things seemed to get worse and worse with every year.
sq: Por pastaj gjërat filluan ngadalë të ndryshojnë: qielli u bë më i errët dhe toka u bë më e ngrohtë. Fillimisht ata menduan se kjo ishte thjesht një luhatje e zakonshme në klimën e botës, por gjërat mesa dukej po bëheshin gjithmonë e më keq çdo vit.

source: The snow began to melt away in a few areas and food became an issue. Other animals tried to leave the region to search for colder areas, but the Pingus knew that this wouldn't help: they knew that they had to do something about it.
sq: Bora filloi të shkrinte në disa vende dhe gjetja e ushqimit po bëhej e vështirë. Disa kafshë provuan të largohen në kërkim të vendeve më të ftohta, por Pingusat e dinin që kjo nuk do të bënte dobi: e dinin që duhet të bënin diçka.

source: So the circle of the eldest came together to decide what to do about it. They decided to send out an expedition around the world to find the cause of this warming. The expedition consisted of hundreds of the bravest Pingus on the South Pole.
sq: E kështu pleqësia u mblodh të vendoste se çfarë duhej bërë. Ata vendosën të dërgojnë në botë një grup zbuluesish për të gjetur shkaqet e kësaj ngrohje. Grupi përbëj nga qindra pingus guximtarë nga Poli i Jugut.

source: And they picked you to lead them on their journey around the world. Since the journey will be dangerous and difficult, your first goal is the Island of Mogorok, also known as the Tutorial Island. According to the eldest, this island has always been the first stop of Pingus that were sent out into the world.
sq: Dhe ata zgjodhën ju që ti udhëhiqni në udhëtimin rreth botës. Meqë udhëtimi do të jetë i rrezikshëm dhe i vështirë, synimi juaj i parë është Ishulli Mogorok, i njohur gjithashtu edhe si Ishulli Praktikues. Sipas pleqve, ky ishull ka qenë gjithmonë ndalesa e parë e Pingusve që dërgoheshin jashtë nëpër botë.

source: The island consists of many areas that are ideal to teach the Pingus their abilities. The Pingus can learn to build bridges, climb, bash and use many other talents which they will need on their long and dangerous journey.
sq: Ishulli ka shumë vende të përsosura për tu mësuar Pingusave aftësitë e tyre. Pingusat mund të mësojnë si të ndërtojnë ura, të ngjiten, të godasin dhe të përdorin shumë dhunti të tjera që do tu duhen në udhëtimin e tyre të gjatë dhe të rrezikshëm.

source: While there, you can practice your abilities in commanding and guiding the Pingus. You can also get familiar with all the abilities the Pingus provide and learn to master them, since you will need all of them on your journey around the world.
sq: Aty ju mund të praktikoni aftësitë tuaja në komandimin dhe udhëheqjen e Pingusave. Ju gjithashtu mund të njiheni me të gjitha aftësitë që Pingus ofron dhe të mësoni ti zotëroni ato, pasi të gjitha do t'ju duhen në udhëtimin përreth botës.

source: Now that you and the Pingus have arrived at Tutorial Island it is time to take command and begin your mission. Good Luck!
sq: Tani që ju dhe Pingusat keni arritur te Ishulli i Praktikës është koha që të merrni drejtimin dhe të filloni detyrën. Suksese!

source: The Journey Continues
sq: Udhëtimi Vazhdon

source: Now after you and the Pingus have learned the basics and practiced a bit it is time to move on and begin the journey into the world. Since the ice floe with which the Pingus traveled to the Tutorial Island isn't going to hold on the whole way into the warmer climates the Pingus have to find something else to guide them on their journey.
sq: Tani që ti dhe pingusat keni mësuar gjërat themelore dhe jeni praktikuar pak, është koha që të vazhdoni përpara dhe të filloni udhëtimin tuaj nëpër botë. Meqenëse udha e akullt nëpërmjet së cilës pingusat udhëtuan deri tek ishulli prove nuk do të qëndrojë e akullt gjatë gjithë udhëtimit për në klimat më të ngrohta, pingusat duhet të gjejnë diçka tjetër që t'i udhëheqë gjatë udhëtimit të tyre.

source: But as the eldest have said, the Tutorial Island provides not only a good way to practice, but it is also the starting point into the world. After some searching the Pingus discovered the meaning of this, and they found the large tree at the end of the island which gave them wood to construct a float.
sq: Por siç kanë thënë të parët, Ishulli Ushtrues nuk është vetëm një mënyrë e mirë për tu praktikuar, por është gjithashtu edhe pika hyrëse për në botë. Pas disa kërkimesh Pingusat e zbuluan kuptimin e kësaj, dhe gjetën pemën e madhe në fund të ishullit nga e cila morën drurin e nevojshëm për të ndërtuar një trap.

source: So the Pingus set out and constructed some large rafts, enough to carry them all. After also packing a bunch of provisions they were prepared to start their journey and leave their familiar ground and enter the unknown parts of the world.
sq: Kështu Pinguinët iu futën punës dhe ndërtuan disa barka të mëdhaja, të mjaftueshme për ti mbajtur të gjithë. Pasi morën edhe disa ushqime me vete ata ishin gati të fillonin udhëtimin e tyre, duke u larguar prej vendeve të njohura dhe duke hyrë në pjesët e panjohura të botës.

source: So the Pingus sit on their raft, worrying about what's to come and where to go, while floating into the sunset. To be continued...
sq: Dhe kështu, Pingusët u ulën në barkën e tyre, me shqetësim për aventurat që i presin, ndërsa lundronin në muzg. Vazhdon...

source: Alien by Josh Dye
sq: Alien nga Josh Dye

source: Escape from alien
sq: Shpëto nga alieni

source: Crystal
sq: Kristal

source: Crystaline sparkling full of danger
sq: Shkëlqim kristalor plot rrezik

source: Desert
sq: Shkretëtirë

source: Getting hot outside...
sq: Jashtë po bëhet vapë...

source: Eye Land
sq: Vendi Sy

source: Factory Campaign
sq: Fushatë Fabrike

source: Pingus expedition
sq: Ekspedita Pingus

source: Halloween 2011
sq: Festat 2011

source: Going Underground
sq: Udhëtim Nëntokë

source: Trapped at All Hallows Eve
sq: Bllokuar te Pragu i të Gjithë Shenjtorëve

source: Hellmouth
sq: Gryka e Skëterrës

source: A cave full of slime...
sq: Një gropë plot me llucë...

source: Jungle
sq: Xhungël

source: Island of Mystery
sq: Ishulli i Fshehtësive

source: Marooned on an Uncharted Isle [by Lachlan McCubbin]
sq: Braktisur në një Ujdhesë të Panjohur [by Lachlan McCubbin]

source: Trapped in a video game
sq: Ngecur në një lojë elektronike

source: Xmas 2011
sq: Krishtlindjet 2011

source: Merry Christmas and a Happy New Year
sq: Gëzuar Krishtlindjet dhe Vitin e Ri
