Repository: B-Translator/old_btr_server
Catalog: modules/custom/btranslator_data/data/import/pingus/pingus-*.po
Languages: sq

source: Object:
sq: Sendi:

source: Nothing selected
sq: Asgjë e përzgjedhur

source: Transparent
sq: E tejdukshme

source: Solid
sq: I ngurtë

source: Ground
sq: Terren

source: Bridge
sq: Urë

source: Water
sq: Ujë

source: Lava
sq: Llavë

source: Remove
sq: Hiq

source: Direction:
sq: Drejtimi:

source: Left
sq: Majtas

source: Misc
sq: Ndrysh

source: Right
sq: Djathtas

source: ReleaseRate:
sq: ShpejtësiLëshimi:

source: Scroll-X:
sq: Lëviz-X:

source: Scroll-Y:
sq: Lëviz-Y:

source: Owner Id:
sq: ID e Zotëruesit:

source: Color:
sq: Ngjyra:

source: Small Stars:
sq: Yje të Vegjël:

source: Middle Stars:
sq: Yje të Mesëm:

source: Large Stars:
sq: Yje të Mëdhenj:

source: Repeat:
sq: Përsërit:

source: Target Id:
sq: ID e Synimit:

source: Height:
sq: Lartësia:

source: Object: [Group]
sq: Send: [Grup]

source: Group not supported
sq: Grupi nuk mbështetet

source: Object:
sq: Send:

source: New level
sq: Nivel i ri

source: Open level...
sq: Hap nivelin...

source: Save level...
sq: Ruaj nivelin...

source: Save level as...
sq: Ruaje nivelin me emër tjetër...

source: Play level...
sq: Luaj nivelin...

source: Configure actions
sq: Formëso veprimet

source: Configure level
sq: Formëso nivelin

source: Display object properties
sq: Trego cilësitë e sendit

source: Show object insertion window
sq: Shfaq dritaren e shtimit të sendeve

source: Show minimap
sq: Shfaq hartën

source: Duplicate the selected objects
sq: Dyfisho sendet e zgjedhura

source: Delete the selected objects
sq: Fshi sendet e zgjedhura

source: Raise object to top
sq: Ngrije sendin sipër

source: Raise object
sq: Ngri sendin

source: Lower object
sq: Zbrite sendin

source: Lower object to bottom
sq: Ule sendin në fund

source: Flip object horizontally
sq: Ktheje sendin horizontalisht

source: Flip object vertically
sq: Ktheje sendin kokëposhtë

source: Rotate object -90 degree
sq: Rrotulloje sendin -90 gradë

source: Rotate object 90 degree
sq: Rrotulloje sendin 90 gradë

source: Display help
sq: Shfaq ndihmën

source: Exit
sq: Dalja

source: Datadir
sq: Direktoria e të dhënave

source: Userdir
sq: Direktoria e përdoruesve

source: Open
sq: Hap

source: Save
sq: Ruaj

source: Cancel
sq: Anullo

source: Filename:
sq: Skedari:

source: Pathname:
sq: Rrugëzimi:

source: Open a level
sq: Hap një nivel

source: Save your level
sq: Ruaj nivelin

source: Author:
sq: Autori:

source: Levelname:
sq: Emërniveli:

source: Description:
sq: Përshkrimi:

source: Pingus Count:
sq: Numri i Pingusave:

source: Pingus to Save:
sq: Pingusat për tu Shpëtuar:

source: Time:
sq: Koha:

source: Width:
sq: Gjerësia:

source: Music:
sq: Muzika:

source: == Editor Help ==
sq: == Ndihmë për Ndryshuesin ==

source: Select all Clear Selection Raise objects Lower objects Raise objects to top Lower objects to bottom Rotate 90 degree Rotate 270 degree Group selected objects Ungroup selected objects
sq: Zgjidhi të gjitha Pastroje Zgjedhjen Ngriji objektet Uli objektet Ngriji objektet në krye Uli objektet në fund Rrotulloje 90 gradë Rrotulloje 270 gradë Bashkoi objektet e zgjedhura Veçoi objektet e zgjedhura

source: Flip object horizontaly Flip object vertically Delete all marked objects Move objects by one pixel Move objects by 32 pixel Toggle background color Increase/lower repeat
sq: Ktheje sendin horizontalisht Ktheje sendin vertikalisht Fshi të gjitha sendet e shënuara Lëvizi sendet me një pikë Lëvizi sendet me 32 pika Ndërro ngjyrën e sfondit Shto/pakso përsëritjen

source: You should name your level files systematically, i.e. by their theme, their number and your nickname: <levelname><number>-<creator>.pingus So if you create your second level with a stone theme, call it: stone2-yourname.pingus When you have created a level and want to have it included in the game mail it to: pingus-devel@nongnu.org Only levels published under the GPL are allowed into the game. The editor automatically inserts a reference to the GPL, if you want to have your level under a different license, you have to change that reference.
sq: Ju duhet t'i emëroni skedarët e niveleve sistematikisht, p.sh. sipas temës, numrit dhe nofkës tënde: <emërniveli><numër>-<krijues>.pingus Pra nëse e krijoni nivelin tuaj të dytë me temë guri, emëroje: gur2-emriyt.pingus Nëse keni krijuar një nivel dhe doni që të përfshihet në lojë, dërgojeni te: pingus-devel@nongnu.org Vetëm nivelet e publikuara me GPL lejohet të përfshihen në lojë. Redaktuesi e shton automatikisht një adresim tek GPL. Nëse doni ta keni nivelin me ndonjë liçensë tjetër, duhet ta ndryshoni këtë adresim.

source: Replace
sq: Zëvendëso

source: Entrance
sq: Hyrje

source: Groundpiece (ground)
sq: Terren (tokë)

source: Groundpiece (solid)
sq: Terren (i ngurtë)

source: Groundpiece (bridge)
sq: Terren (urë)

source: Groundpiece (transparent)
sq: Terren (i tejdukshëm)

source: Groundpiece (remove)
sq: Terren (hiqe)

source: Hotspot
sq: Pikë e Ndjeshme

source: Background
sq: Sfondi

source: Liquid
sq: Lëng

source: Trap
sq: Kurth

source: Weather
sq: Moti

source: Special Object
sq: Send i Veçantë

source: Prefab Object
sq: Send i Paraprodhuar

source: Released:%3d/%d Out:%3d Saved:%3d/%d
sq: Lëshuar:%3d/%d Jashtë:%3d Shpëtuar:%3d/%d

source: Angel
sq: Engjëll

source: Basher
sq: Goditës

source: Blocker
sq: Bllokues

source: Boarder
sq: Shtruesi

source: Bomber
sq: Bombardues

source: Bridger
sq: Urëndërtues

source: Climber
sq: Alpinist

source: Digger
sq: Gërmues

source: Drown
sq: I mbytur

source: Exiter
sq: Dalës

source: Faller
sq: Rënës

source: Floater
sq: Flluskues

source: Jumper
sq: Kapërcyes

source: Laserkill
sq: Vrasje me lazër

source: Miner
sq: Gërmues

source: Slider
sq: Rrëshqitës

source: Smashed
sq: Zgërlaqur

source: Splashed
sq: Përplasur

source: Superman
sq: Mbinjeri

source: Teleported
sq: I transferuar

source: Waiter
sq: Kamarier

source: Walker
sq: Këmbësor

source: skip
sq: anashkalo

source: Play
sq: Luaj

source: Back
sq: Mbrapa

source: Number of Pingus:
sq: Numri i Pingusve:

source: Number to Save:
sq: Sa Duhen Shpëtuar:

source: Time:
sq: Koha:

source: Author:
sq: Autori:

source: Close
sq: Mbyll

source: Fullscreen
sq: Gjithekrani

source: Mouse Grab
sq: Kapje Miushi

source: Autoscrolling
sq: Vetlëvizje

source: Drag&Drop Scrolling
sq: Lëvizje me Zvarritje

source: Print FPS
sq: Shtyp FPS

source: Resolution:
sq: Imtësia:

source: Renderer:
sq: Vizatues:

source: Language:
sq: Gjuha:

source: Master Volume:
sq: Vëllimi Kryesor:

source: Sound Volume:
sq: Vëllimi i Zërit

source: Music Volume:
sq: Vëllimi i Muzikës:

source: Option Menu
sq: Menuja e Zgjedhjeve

source: Some options require a restart of the game to take effect.
sq: Disa zgjedhje kërkojnë rinisje të lojës për të patur ndikim.

source: Story
sq: Tregim

source: ..:: Start the game ::..
sq: ..:: Fillo lojën ::..

source: Editor
sq: Ndryshues

source: ..:: Create your own levels ::..
sq: .:: Krijo nivelet e tua ::..

source: Options
sq: Mundësitë

source: ..:: Configure the game ::..
sq: ..:: Formëso lojën ::..

source: Levelsets
sq: Nivele vështirësie

source: ..:: Play User Built levels ::..
sq: ..:: Luaj Nivelet e Ndërtuara nga Përdoruesit ::..

source: ..:: Bye, bye ::..
sq: ..:: Mirupafshim ::..

source: ..:: Ctrl-g: mouse grab :: F10: fps counter :: F11: fullscreen :: F12: screenshot ::..
sq: ..:: Ctrl-g: kap miushin :: F10: numërues fps :: F11: gjithekrani :: F12: pamje-ekrani ::..

source: Give up
sq: Dorëzohu

source: Retry
sq: Riprovo

source: Success!
sq: Me sukses!

source: Failure!
sq: Dështim!

source: Perfect! You saved everyone possible - great!
sq: Shkëlqyer! Shpëtuat gjithë sa mund të shpëtoheshin - mrekulli!

source: No-one got killed, pretty good work.
sq: Askush nuk u vra, punë mjaft e mirë.

source: You saved exactly what you needed - you made it, but maybe you can do better?
sq: Shpëtove tamam aq sa duhej - ia dole mbanë, por ndoshta mund ta bëni edhe më mirë?

source: Not everybody was saved, but still good work!
sq: Nuk shpëtuan të gjithë, por prapë punë e mirë!

source: What can I say, you made it - congratulations!
sq: Nuk kam ç'të them, ia dole mbanë. Përgëzime!

source: You killed everybody, not good.
sq: Tu vranë të gjithë, jo mirë.

source: No-one got saved - I know you can do better.
sq: Asnjë nuk u shpëtua - unë e di që mund të luash më mirë.

source: You didn't save enough, but you saved a few. Next time you might do better.
sq: Nuk shpëtove sa duhet, por të paktën shpëtove disa. Herën tjetër mund të dalësh më mirë.

source: Only one more and you would have made it - try again!
sq: E ke humbur vetëm për një - provo sërish!

source: Only a handful more and you would have made it - try again!
sq: Edhe disa të tjerë dhe do t'ia kishe dalë - provoje përsëri!

source: Better luck next time!
sq: Më shumë fat herën tjetër!

source: Saved:
sq: Shpëtuar:

source: Died:
sq: Vdiqën:

source: Time left:
sq: Koha e mbetur:

source: Under Construction
sq: Në Krijim

source: Untested, unpolished and broken levels
sq: Nivelet e patestuara, të palëmuara dhe të parregulluara

source: Solved:
sq: Zgjidhur:

source: levels
sq: Nivelet

source: Show Ending?
sq: Po Mbaron Shfaqja?

source: Leave?
sq: Largim?

source: [OPTIONS]... [FILE]
sq: [MUNDESITE]... [SKEDARI]

source: Pingus is a puzzle game where you need to guide a bunch of little penguins around the world.
sq: Pingus është një lojë gjëagjëzë ku ju duhet të udhëzoni një grup pinguinësh të vegjël në një udhëtim rreth botës.

source: General Options:
sq: Mundësi të Përgjithshme:

source: Displays this help
sq: Shfaq këtë mesazh ndihme

source: Print version number and exit
sq: Shkruaj numrin e versionit dhe dil

source: Enable info level log output
sq: Mundëso nxjerrjen e shënimeve në shkallën njoftuese

source: Enable debug level log output
sq: Mundëso nxjerrjen e shënimeve në shkallën hetuese

source: Disable all log output
sq: Ndalo gjithë nxjerrjet e shënimeve

source: Display Options:
sq: Mundësitë e Paraqitjes:

source: Start in Window Mode
sq: Fillo në Mënyrën me Dritare

source: Start in Fullscreen
sq: Fillo në Pamje të plotë

source: Use the given renderer (default: sdl)
sq: Përdor paraqitësin e dhënë (zakonisht: sdl)

source: Set the window resolution for pingus (default: 800x600)
sq: Vendos imtësinë e ekranit për pingus (zakonisht: 800x600)

source: Set the resolution used in fullscreen mode (default: 800x600)
sq: Vendos imtësinë që përdoret në mënyrën gjithekran (e paracaktuar: 800X600)

source: Enable software cursor
sq: Mundëso kursorin programor

source: Game Options:
sq: Zgjedhjet e Lojës:

source: Disable automatic scrolling
sq: Ndalo rrëshkitjen e vetvetishme

source: Enable drag'n drop scrolling
sq: Mundëso lëvizjen zvarrit-e-lësho

source: Sound Options:
sq: Rregullimet e Zërit:

source: Disable sound
sq: Ndalo zërin

source: Disable music
sq: Ndalo muzikën

source: Select language to use with Pingus
sq: Zgjidh gjuhën që do përdoret në Pingus

source: List all available languages
sq: Rreshto gjuhët e mundshme

source: Loads the level editor
sq: Ngarkon ndërtuesin e niveleve

source: Directory Options:
sq: Mundësitë e Direktorisë

source: Load game datafiles from DIR
sq: Ngarko të dhënat e lojës nga DIR

source: Load config files and store savegames in DIR
sq: Ngarko skedaret e konfigurimit dhe ruaj lojrat në DIR

source: Load game modifications from DIR
sq: Ngarko ndryshimet e lojës nga DIR

source: Don't read ~/.pingus/config
sq: Mos e lexo ~/.pingus/config

source: Read config options from FILE
sq: Lexo konfigurimin nga FILE

source: Uses the controller given in FILE
sq: Përdor kontrolluesin e dhënë në SKEDAR

source: Debug Options:
sq: Mundësitë e Hetimit:

source: Enables some special features for developers
sq: Mundëson disa veçori të posaçme për ndërtuesit.

source: Set the game speed (0=fastest, >0=slower)
sq: Vendos shpejtësinë e lojës (0 -- më e shpejta, >0 -- më ngadalë)

source: Set the desired game framerate (frames per second)
sq: Cakto shpejtësinë e dëshiruar për shfaqjen e pamjeve të lojës (pamje në sekondë)

source: Set the size of the map tiles (default: 32)
sq: Cakto madhësinë e pllakave të hartës (zakonisht: 32)

source: Pingus: Out of memory!
sq: Pingus: Mbaroi kujtesa!

source: Pingus: Standard exception caught!:
sq: Pingus: U kap një përjashtim i zakonshëm!:

source: Pingus: Unknown throw caught!
sq: Pingus: U kap një hedhje e panjohur!

source: unlimited
sq: pakufizuar

source: Screenshot: Saving screenshot to:
sq: Pamje ekrani: Pamja po ruhet te:

source: Screenshot: Screenshot is done.
sq: Pamje ekrani: Marrja e pamjes së ekranit u bë.

source: Screenshot: Couldn't write file:
sq: Pamje ekrani: Nuk mund të shkruhej skedari:

source: If the way is blocked, bash away
sq: Nëse rruga është e bllokuar, ec me goditje

source: Similar to the Digger action that you already know from previous levels, there is also an action that allows the Pingus to dig horizontally, as opposed to the vertical dig ability the Digger action provides. This new action is called Basher.
sq: Ngjashëm me veprimin Gërmues që tashmë e njihni nga nivelet e mëparshme, është edhe një veprim që i lejon Pingusat të gërmojnë përpara, në ndryshim nga mundësia për të gërmuar poshtë që ua jep veprimi Gërmues. Ky veprim i ri quhet Goditës.

source: Sacrifice a few and save the rest
sq: Sakrifiko disa dhe shpëto të tjerët

source: Sometimes no other actions are available, so you have to bomb your way through the ground. The Pingus can do this by actually self- destructing. This will kill them, but it is sometimes necessary to sacrifice a few to save the rest.
sq: Ndonjëherë nuk ka veprime tjera të përdorshme, kështu që duhet ta çani rrugën përmes tokës me bombardim. Pingusat mund ta bëjnë këtë duke shkatërruar në fakt vetveten. Kjo do t’i vrasë ata, por ndonjëherë është e domosdoshme të sakrifikohen disa për të shpëtuar të tjerët.

source: Learning to dig
sq: Mëso të gërmosh

source: This is your first mission. As always, it's pretty easy. All you have to do is to give a Pingu the command to dig a hole into the ground so that they can reach the exit. This can be accomplished simply by clicking on a Pingu.
sq: Ky është misioni yt i parë. Si gjithmonë, është mjaft i thjeshtë. Ajo që duhet të bësh është ti japësh një Pingu komandën për të gërrmuar një gropë në tokë në mënyrë që të arrijnë daljen. Kjo mund të bëhet thjeshtë duke klikuar mbi një Pingu.

source: Float or Die
sq: Flluskim a Vdekje

source: Well done in mission one! Now let's start the next one. This time you will need to equip your Pingus with a little propeller, so that they can float to the ground smoothly. If Pingus fall too far, they will not be able to survive the fall, so keep your eyes open!
sq: Punë e mirë në misionin e parë! Tani le të fillojmë tjetrin. Këtë herë ju duhet t'i pajisni Pingusat me një helikë të vogël, në mënyre që të mund të rrinë pezull dhe të bien në tokë butësisht. Nëse Pingusat bien nga një lartësi e madhe, nuk mund t'i mbijetojnë rënies, kështu që i bëni sytë katër!

source: Jump for joy
sq: Fluturoj nga gëzimi

source: Sometimes a Pingu needs to reach a platform that is far away, but not reachable by walking. That's when the Jumper comes in handy - it allows the Pingu to make a small jump and so enables him to reach the platform.
sq: Ndonjëherë një Pingusi i nevojitet të arrijë një platformë që është larg, por që nuk mund të arrihet duke ecur. Në këtë rast na hyn në punë Kërcyesi, i cili i jep mundësi Pingut të bëjë një kërcim të vogël që të mund të arrijë platformën.

source: Miner's heaven
sq: Parajsa e minatorit

source: Another action hits the street - another digging action, this time a diagonal one. It allows a Pingu to dig diagonally through ground, thus creating a path for following Pingus. The action is called Miner.
sq: Një tjetër veprim del në shesh - një veprim tjetër gërmues, këtë herë tërthorazi. Ky i jep mundësi një Pingu të gërmojë tërthorazi përmes tokës, duke hapur një shteg për Pingusat pasues. Veprimi quhet Minator.

source: Panic Island (float/bash)
sq: Ishulli i Panikut (plusko/godit)

source: While the previous levels have not required much quick action from you, this one gets a bit trickier. The Pingus are coming out of two entrances in parallel and it is your job to coordinate the two groups wisely.
sq: Nëse nivelet e mëparshme nuk kanë kërkuar dhe aq veprim të shpejtë, ky bëhet pak më i ndërlikuar. Pingusat vijnë nga dy dalje njëkohësisht dhe është detyra juaj që ti bashkërendoni të dyja grupet me mençuri.

source: Jump'n Bump... and Bash...
sq: Hidhu, Përplasu... dhe Godit...

source: It's panic time again. The Pingus will not come out very fast, but since they turn around when they hit walls you will soon have some trouble coordinating them all. Since you only need to save 5 it should be doable, but if all else fails use the pause-mode ('p') to get an overview again.
sq: Është kohë paniku përsëri. Pingusat nuk do të dalin shumë shpejt, por meqënëse ata kthehen mbrapsht kur takojnë muret, prapë do ta keni pak vështirë për ti bashkërenduar që të gjithë. Meqënëse duhet të shpëtoni vetëm 5, nuk duhet të jetë e pamundur. Por fundja nëse s'ia dilni dot, përdorni ndalesën ('p' -- pause) për të pasur një vështrim përmbledhës përsëri.

source: Two groups in parallel, coordinate wisely
sq: Dy grupe në paralel, bashkërendo me kujdes

source: You have two groups to coordinate this time. No need to panic, since this level gives you enough time to think your actions through. No more tips this time, but good luck!
sq: Këtë herë duhet të bashkërendoni dy grupe. Mos u shqetësoni, sepse ky nivel ju jep kohë të mjaftueshme që ti mendoni mirë veprimet tuaja. Nuk ka udhëzime këtë herë, por suksese!

source: Block'a Rock
sq: Shkëmb që të Trëmb

source: Once again it's time to combine the things you have learned in your previous levels. Blast your way free and make sure you also keep the rest of the Pingus under control. The Blocker action will be helpful.
sq: Edhe një herë është koha për të ndërthurur gjërat që keni mësuar në nivelet e mëparshëm. Çlirojeni rrugën me shpërthime dhe bëni kujdes që ti mbani edhe pinguinët e tjerë në kontroll. Veprimi Bllokues do t'ju ndihmojë.

source: Climb, Climber,... Boom!
sq: Ngjitje, Alpinist,... Bum!

source: As you might have already figured out from previous levels, you often have to combine different actions to get the job done. Due to the lack of a Digger action in this level the Bomber needs to jump in, but how can it reach the place to bomb?
sq: Siç mund ta keni kuptuar tashmë nga nivelet e mëparshme, për të mbaruar punë, shpesh ju duhet të ndërthurni veprime të ndryshme. Për shkak të mungesës në këtë nivel të një veprimi Gërmues, duhet të hidhet në veprim Kamikazi (Bombarduesi). Por si mund ta arrijë vendin që duhet bombarduar?

source: Bridging gets more complicated...
sq: Ndërtimi i urave bëhet gjithmonë e më i ndërlikuar...

source: Once again you have to combine actions carefully and wisely. If you don't you could end up in the hole just before the exit, so think about how to avoid that.
sq: Edhe një herë duhesh ti kombinosh veprat me kujdes dhe me mençuri. Në të kundërt mund të përfundosh në grackën pak para daljes, prandaj mendo si t'i shpëtosh grackës.

source: If too high, your Pingu will die...
sq: Po qe shumë lart, Pingu do vdesë...

source: Teamwork is the way to the exit this time. You don't have enough Floaters to reach the exit, so just send a few and let them prepare the path for the rest.
sq: Këtë herë mund të dilet vetëm duke punuar në grup. Nuk keni Flluskues të mjaftueshëm për të arritur daljen, kështu që dërgoni disa që të përgatisin rrugën për të tjerët.

source: Learn to use the bridge
sq: Mëso të përdorësh urën

source: If no Jumper is at hand and a large hole needs to be passed, a bridge can be pretty helpful. It takes some time to build, but unlike the jumper action it allows following Pingus to reach the other end too.
sq: Nëse nuk ka Kërcyes dhe duhet kaluar një gropë e madhe, një urë mund të jetë mjaft e dobishme. Vërtetë që do ca kohë për tu ndërtuar, por ndryshe nga veprimi i kërcimit, u lejon edhe Pingusave pasues që të arrijnë në anën tjetër.

source: Three solutions, it's up to you
sq: Tre zgjidhje, është në dorën tënde

source: Now that you've learned all the actions, it's time for some more practice. This level presents you with at least three different ways to solve it. It's up to you which one you pick.
sq: Tani që i keni mësuar të gjitha veprimet, është koha për tu ushtruar edhe pak. Ky nivel ka të paktën tre mënyra zgjidhje. Është në dorën tuaj se cilën do të përdorni.

source: Climb, Climber, climb... and build a bridge
sq: Ngjitu, ngjitës, ngjitu... dhe ndërto një urë

source: Once again you get access to a new action. The Climber action allows a Pingu to climb up straight walls, thus allowing him to reach stuff that might be too high to reach by other means.
sq: Edhe një herë ju keni qasje në një veprim të ri. Veprimi i Ngjitjes e bën një Pingu të ngjitet lartë në mure, duke ia mundësuar kështu të arrijë gjëra që mund të jenë të pa-arritshme me mjete të tjera.

source: Entrance high, Exit low
sq: Hyrja lartë, Dalja poshtë

source: If you don't have enough floaters to bring all the Pingus down to the exit - you have to find other ways to guide them down. You should have learned all the stuff you need for this level in previous levels, so this shouldn't be too much of a problem for you.
sq: Nëse flluskuesat nuk dalin për ti zbritur të gjithë Pingusat te dalja, duhet të gjeni mënyra të tjera për ti çuar poshtë. Gjithë çka ju duhet për këtë nivel duhet ta keni mësuar tashmë në nivelet e mëparshme, kështu që nuk do ta keni shumë problem këtë.

source: One must prepare, the rest must follow
sq: Njëri duhet të përgatisë, te tjerët duhet ta ndjekin

source: Sometimes there are situations where you don't have a Blocker at hand to coordinate your Pingus. You'll have to find other ways to keep them under control while a single one prepares the path for the rest.
sq: Ndonjëherë ka situata kur nuk ju ndodhet Bllokues për t'i orientuar Pingusat. Do t'ju duhet të gjeni mënyra të tjera për ti mbajtur ata në kontroll ndërkohë që njëri përgatit shtegun për të tjerët.

source: Dig and float, just don't fall and smash
sq: Gërmo dhe fluturo, vetëm mos u rrëzo dhe mos u dërrmo

source: Unlike the first two levels, you have two actions available in this level. Your job is again simple: select an action at the panel on the left and apply it to the Pingus so that they will be able to reach the exit. Make sure that not too many of them die.
sq: Ndryshe nga dy nivelet e para, mund të bëni dy veprime në këtë nivel. Përsëri detyra juaj është e thjeshtë: zgjidh një veprim në panelin majtas dhe zbatoje atë te Pingusat, në mënyrë që ata të mund të arrijnë daljen. Përpiqu që të mos vdesin shumë prej tyre.

source: Dig, bash and other problems
sq: Gërmo, godit dhe probleme të tjera

source: The more levels you master, the more difficult they will get, but don't panic, as this one is still pretty easy. Just use the stuff that you've learned in the previous levels and you shouldn't have many problems. If you think you've reached a situation from which you can no longer solve the level, double click the armageddon button at the lower right.
sq: Sa më shumë nivele kaloni, aq më të vështira bëhen, por mos u trembni, sepse ky nivel është akoma shumë i thjeshtë. Thjesht përdorni ato që keni mësuar në nivelet e mëparshme dhe nuk do keni shumë probleme. Nëse ju duket se keni arritur në një situatë në të cilën nuk mund ta përfundoni nivelin, i bëni dopjo klik butonit të kijametit që ndodhet poshtë djathtas.

source: Solid ground can block the path
sq: Terreni i gurtë mund të pengojë rrugën
