Repository: B-Translator/old_btr_server
Catalog: l10n/btranslator.*.po
Languages: sq

source: Send e-mail to admin when a new user is registered
sq: Njofto administratorin kur rregjistrohet një përdorues i ri.

source: Send e-mail to admin when user modifies his account
sq: Dërgo e-mail te admin kur një përdorues ndryshon llogarinë e tij

source: Drupal installation profile for B-Translator.
sq: Profil instalimi Drupal për B-Translator

source: B-Translator configuration options
sq: Mundësitë e trajtësimit të B-Translator

source: Translation Language
sq: Gjuha e Përkthimit

source: The language of translations. This site is about collecting feedback for the translations of this language.
sq: Gjuha e përkthimit. Kjo faqe ka si qëllim rishikimin dhe përmirësimin e përkthimeve në këtë gjuhë.

source: Multiple
sq: Shumëfish

source: When voting mode is <em>Single</em>, only one translation can be voted as suitable for each string. When voting mode is <em>Multiple</em>, more than one translation can be selected as suitable for each string. <br/> <strong>Note:</strong> Switching back from <em>Multiple</em> to <em>Single</em> may have a bad impact on the existing votes.
sq: Kur mënyra e votimit është <em>Vetëm një</em>, vetën një përkthim mund të votohet si i përshtatshëm për secilin varg. Kur mënyra e votimit është <em>Një ose më shumë</em>, një ose më shumë përkthime mund të zgjidhen si të përshtatshme për secilin varg. <br/> <strong>Shënim:</strong> Kalimi nga mënyra <em>Një ose më shumë</em> te <em>Vetëm një</em> mund të ketë një ndikim të keq te votat egzistuese.

source: Select Voting Mode
sq: Zgjidh Mënyrën e Votimit

source: B-Translator default settings
sq: Rregullimet normale të B-Translator

source: Select the projects that will be used for review and translations. Only strings from these projects will be presented to the users. <br/> You can enter projects in the form <em>origin/project</em>, for example: <em>KDE/kdeedu</em>, <em>Mozilla/browser</em>, etc. Or you can include all the projects from a certain origin, like this: <em>KDE</em>, <em>LibreOffice</em>, etc. <br/> Enter each project on a separate line. See a list of the imported projects <a href='@project-list' target='_blank'>here</a>.<br/> <strong>Note</strong>: The user can override the preferred projects on his profile/settings. If the user does not select any preferred projects on his profile, then the projects listed here will be used. If this list is empty, then all the imported projects will be used.
sq: Zgjidh projektet që do të përdoren për rishikim dhe përkthim. Vetëm vargje nga këto projekte do tu paraqiten përdoruesve. <br/> Mund ti jepni projektet në formën <em>origjinë/projekt</em>, për shembull: <em>KDE/kdeedu</em>, <em>Mozilla/browser</em>, etc. Ose mund të përfshini të gjithë projektet nga një origjinë e caktuar, si: <em>KDE</em>, <em>LibreOffice</em>, etj. <br/> Shkruajeni çdo projekt në një rresht të veçantë. Lista e projekteve të importuara mund të shihet <a href='@project-list' target='_blank'>këtu</a>.<br/> <strong>Shënim</strong>: Përdoruesi mund t'i ndryshojë projektet e pëlqyera në profilin e tij. Nëse përdoruesi nuk ka zgjedhur ndonjë projekt të pëlqyer, atëherë projektet e rreshtuara këtu do të përdoren. Nëse kjo listë është bosh, atëherë të gjitha projektet e importuara do të përdoren.

source: The List of Projects that Will be Used for Voting and Translation
sq: Lista e Projekteve që do Përdoren për Votimet dhe Përkthimet

source: B-Translator: Top contributors during the last period
sq: B-Translator: Ndihmuesit më të mirë këto kohët e fundit

source: B-Translator: Contribution statistics (for the last week, month and year)
sq: B-Translator: Statistikat e kontributeve (për javën, muajin dhe vitin e fundit)

source: B-Translator: Latest contributions
sq: B-Translator: Ndihmesat e fundit

source: Size of the list
sq: Madhësia e listës

source: The number of top contributers that will be shown in the list (5, 10, etc)
sq: Numri i kontribuesve më të mirë që do dalin në listë (5, 10, etj.)

source: Accumulation period
sq: Periudha e grumbullimit

source: The period during which the contributions will be counted (last week or last month).
sq: Koha gjatë së cilës ndihmesat do të llogariten (java e fundit ose muaji i fundit).

source: Last month
sq: Muaji i fundit

source: Top @nr contributors
sq: Kontribuesit më të mirë

source: Contribution statistics
sq: Statistikat e kontributeve

source: Latest contributions
sq: Kontributet e fundit

source: <p>Top !nr contributors since !date:</p>
sq: <p>!nr kontribuesit më të mirë qysh prej !date:</p>

source: <strong><a href='@url_user' target='_blank'>!name</a></strong><br/><a href='@url_translations' target='_blank'>!nr_translations translations</a> + <a href='@url_votes' target='_blank'>!nr_votes votes</a>
sq: <strong><a href='@url_user' target='_blank'>!name</a></strong><br/><a href='@url_translations' target='_blank'>!nr_translations përkthime</a> + <a href='@url_votes' target='_blank'>!nr_votes vota</a>

source: + <a href='@url_votes'>!nr_votes votes</a> <br/> + <a href='@url_translations'>!nr_translations translations</a>
sq: + <a href='@url_votes'>!nr_votes vota</a> <br/> + <a href='@url_translations'>!nr_translations përkthime</a>

source: Translation Projects
sq: Projektet e Përkthimit

source: Project Title
sq: Titulli i Projektit

source: Translating a software project.
sq: Përkthimi i një programi.

source: Project Description
sq: Përshkrimi i Projektit

source: Hide string details.
sq: Fshih hollësitë e vargut.

source: Loading...
sq: Ngarkimi...

source: Undo decline
sq: Zhbëj fshirjen

source: Do you want to overwrite the current suggestion?
sq: Do që ta mbishkruash sugjerimin e tanishëm?

source: Export a Project
sq: Eksporto një Projekt

source: The origin of the project.
sq: Prejardhja e projektit.

source: Project
sq: Projekti

source: The name of the project.
sq: Emri i projektit.

source: Export Mode
sq: Mënyra e Eksportimit

source: The export mode that should be used.
sq: Mënyra e eksportimit që duhet të përdoret

source: Export the most voted translations
sq: Eksporto përkthimet më të votuara

source: Prefer translations voted by me
sq: Pëlqej përkthimet e votuara prej meje

source: Prefer translations voted by my friends
sq: Pëlqej përkthimet e votuara nga shokët e mi

source: List of Friends
sq: Lista e Shokëve

source: Enter usernames of your friends, separated by comma.
sq: Jepni emrat që përdorin shokët tuaj, të ndarë me presje.

source: Export
sq: Eksporto

source: Export of '!project' is scheduled. You will be notified by email when it is done.
sq: Eksportimi i '!project' është vënë në listë. Do të njoftoheni me email kur të jetë kryer.

source: The project '!project' does not exist.
sq: Projekti '!project' nuk gjendet.

source: The user '!username' does not exist.
sq: Përdoruesi '!username' nuk egziston.

source: Add a New Term
sq: Shto një Fjalë të Re

source: Add a new interesting term on the vocabulary.
sq: Shto një fjalë të re interesante në fjalor.

source: New Term
sq: Fjala e Re

source: Add
sq: Shto

source: This term already exists.
sq: Kjo fjalë është e shënuar.

source: Delete a Term
sq: Fshi një Fjalë

source: Delete a term from the vocabulary.
sq: Fshi një fjalë nga fjalori.

source: String ID
sq: Varg ID

source: Delete
sq: Fshi

source: Search Translations
sq: Kërko te Përkthimet

source: No strings found. Try adjusting the filter options.
sq: Nuk u gjet asnjë varg. Ndrysho njëherë vlerat e filtrit.

source: Reset
sq: Rivendos

source: Filter
sq: Filtër

source: Change Filter Parameters
sq: Ndrysho Parametrat e Filtrit

source: Language of Translation
sq: Gjuha e Përkthimit

source: Select the language of the translations to be searched and displayed.
sq: Zgjidh gjuhën e përkthimeve që do kërkohen dhe shfaqen.

source: What To Search For
sq: Për Çfarë Të Kërkohet

source: Search Mode
sq: Mënyra e Kërkimit

source: The String Or Words To Be Searched
sq: Vargu Ose Fjalët Për Tu Kërkuar

source: The number of the results (strings) that can be displayed on a page.
sq: Numri i rezultateve (vargjeve) që mund të shfaqen në një faqe.

source: Search Scope
sq: Shtrirja e Kërkimit

source: Projects
sq: Projektet

source: Search only the strings belonging to the matching project.
sq: Kërko vetëm te vargjet që i përkasin projektit që pëputhet.

source: Limit search only to the projects from a certain origin.
sq: Kufizo kërkimin vetëm te projektet nga një origjinë e caktuar.

source: Author
sq: Autori

source: Only Mine
sq: Vetëm të Miat

source: Search only the strings with translations suggested or voted by me.
sq: Kërko vetëm vargjet me përkthime të bëra ose të pëlqyera prej meje.

source: Translated By
sq: Përkthyer Nga

source: Search only the strings with translations suggested by the selected user.
sq: Kërko vetëm në vargjet me përkthime të sugjeruara nga përdoruesi i zgjedhur.

source: Voted By
sq: Votuar Nga

source: Search only the strings with translations voted by the selected user.
sq: Kërko vetëm në vargjet me përkthime të votuara nga përdoruesi i zgjedhur.

source: What to Filter
sq: Çfarë të Filtrohet

source: Select what to filter by date (strings, translations, or votes).
sq: Zgjidh se çfarë duhet të filtrohet sipas datës (vargjet, përkthimet, apo votat).

source: From Date
sq: Nga Data

source: To Date
sq: Në Datën

source: Natural search on strings.
sq: Kërkim natyral te vargjet.

source: Natural search on translations.
sq: Kërkim i natyrshëm te përkthimet.

source: Boolean search on strings.
sq: Kërkim llogjik te vargjet.

source: Boolean search on translations.
sq: Kërkim llogjik te përkthimet.

source: Filter Strings By Date
sq: Filtro Vargjet Sipas Datës

source: Filter Translations By Date
sq: Filtro Përkthimet Sipas Datës

source: Filter Votes By Date
sq: Filtro Votat Sipas Datës

source: Vote Translations
sq: Voto Përkthimet

source: Login link has expired.
sq: Lidhja e hyrjes ka skaduar.

source: Could not validate login link.
sq: Adresa e hyrjes nuk është e vlefshme.

source: Previous
sq: Paraardhëse

source: Login
sq: Hyrje

source: Save
sq: Ruaj

source: Next
sq: Tjetra

source: Translated
sq: Përkthyer

source: Untranslated
sq: Papërkthyer

# set the page title
source: String: !string
sq: Vargu: !string

source: Translate
sq: Përkthe

source: (empty)
sq: (bosh)

source: <New translation>
sq: <Përkthim i ri>

source: Edit a copy
sq: Ndrysho një kopje

source: Number of Votes: !count
sq: Numri i Votave: !count

source: uknown user
sq: përdorues i panjohur

source: unknown time
sq: kohë e panjohur

source: no time record available
sq: nuk ka rregjistrim kohe

source: You need to be logged in, in order to be able to submit votes and suggestions.
sq: Duhet të jeni brenda, që të mund të jepni vota dhe sugjerime.

source: You don't have access for giving feedback!
sq: Nuk keni të drejta për të dhënë sugjerime!

source: You cannot give feedback for the language '@lng' on this site!
sq: Nuk mund të jepni vlerësime për gjuhën '@lng' në këtë faqe!

source: Source text
sq: Teksti Fillestar

source: Translations
sq: Përkthimet

source: Direct and permanent link to this string.
sq: Lidhje e drejtpërdrejtë dhe e përhershme te ky varg.

source: Show the string context and a list of projects where this string is used.
sq: Trego rrethanat e vargut dhe një listë të projekteve ku përdoret vargu.

source: Show string details.
sq: Trego hollësitë e vargut.

source: in context: @context
sq: në rrethana: @context

source: Export path
sq: Vendi i eksportimeve

source: Notify admin
sq: Njofto administratorin

source: Send a notification email to admin on each export request.
sq: Dërgo një letër njoftimi te mbikëqyrësi për çdo kërkesë eksportimi.

source: Vote translations.
sq: Voto përkthimet.

source: Can submit votes (or likes) for translation suggestions.
sq: Mund të japë vota (ose pëlqime) për përkthimet e sugjeruara.

source: Suggest new translations.
sq: Sugjero përkthime të reja.

source: Can submit new translation suggestions.
sq: Mund të bëjë sugjerime përkthimesh të reja.

source: Flag translations.
sq: Sinjalizo përkthimet.

source: Can flag translations as inaproppriate.
sq: Mund ti shënojë përkthimet si të papërshtatshme.

source: Import translation (PO) files.
sq: Importo skedarët e përkthimit (skedarët PO).

source: Can import to B-Translator new translation files (in the PO format).
sq: Mund të importojë në B-Translator skedarë të rinj përkthimi (në formatin PO).

source: Export translation files.
sq: Eksporto skedarët e përkthimit.

source: Can export translations from B-Translator (either in PO format, or as diff/ediff).
sq: Mund të eksportojë përkthimet nga B-Translator (në format PO ose si diff/ediff).

source: Statistics.
sq: Statistikat.

source: Can access global statistics of B-Translator.
sq: Mund të shohë statistikat e përgjithshme në B-Translator.

source: Resolve issues.
sq: Zgjidh problemet.

source: Can resolve flag issues and other problems.
sq: Mund të vendosë rreth sinjalizimeve dhe për probleme të tjera.

source: Can perform administration tasks for B-Translator.
sq: Mund të bëjë detyra administruese në B-Translator.

source: Used with context: %context
sq: Përdorur në rrethanat: %context

source: Used on these projects:
sq: Përdorur në këto projekte:

source: It seems that there is something wrong with your preferences. Please <a href='@edit-profile'>check your profile</a>.
sq: Duket se diçka nuk është në rregull me të pëlqyerat tuaja. Ju lutem <a href='@edit-profile'>kontrolloni profilin tuaj</a>.

source: [!prefix] Translation modified for: !string
sq: [!prefix] Përkthimi u ndryshua për: !string

source: Greetings !username, The following translation has been modified by its author. You are being notified because you have voted for the old translation and your vote now counts for the new version of the translation. If the new version of the translation is OK for you, then there is nothing you should do. Otherwise, you can change your vote at this link: !url Thanks ---------- Original (English) String: !string ---------- Old Translation: !old_translation ---------- New Translation: !new_translation ----------
sq: Përshëndetje !username, Përkthimi i mëposhtëm është ndryshuar nga autori. Po njoftoheni sepse ju keni votuar për përkthimin e vjetër dhe vota juaj tashmë llogaritet për versionin e ri të përkthimit. Nëse versioni i ri i përkthimit ju duket në rregull, nuk është nevoja të bëni gjë. Përndryshe, mund ta ndryshoni votën tuaj te kjo lidhje: !url Faleminderit ---------- Vargu Origjinal (Anglisht): !string ---------- Përkthimi i Vjetër: !old_translation ---------- Përkthimi i Ri: !new_translation ----------

source: [!prefix] New translation for: !string
sq: [!prefix] Përkthim i ri për: !string

source: Greetings !username, A new translation has been suggested for a string that you have voted for. If you think that the new translation is more suitable than the one that you have voted for, then you can change your vote at this link: !url Thanks ---------- Original (English) String: !string ---------- Voted Translation: !voted_translation ---------- New Translation: !new_translation ----------
sq: Përshëndetje !username, Një përkthim i ri është sugjeruar për një varg që ju keni votuar. Nëse përkthimi i ri ju duket më i përshtatshëm se ai që keni votuar, mund ta ndryshoni votën te kjo adresë: !url Faleminderit ---------- Vargu Origjinal (Anglisht): !string ---------- Përkthimi i Votuar: !voted_translation ---------- Përkthimi i Ri: !new_translation ----------

source: [!prefix] New term: !string
sq: [!prefix] Fjalë e re: !string

source: Greetings !username, A new term has been added to the vocabulary by !author: !string You can review its translation at this link: !url Thanks ---------- - You can add a new term at: !url_add_term - You can see all the vocabulary terms at: !url_vocabulary
sq: Përshëndetje !username, !author ka shtuar një fjalë të re në fjalor: !string Mund ta shikoni përkthimin te kjo lidhje: !url Faleminderit ---------- - Mund të shtoni një fjalë të re te: !url_add_term - Mund ti shihni të gjitha fjalët e fjalorit te: !url_vocabulary

source: [!prefix] Translation deleted: !translation
sq: [!prefix] Fshirje përkthimi: !translation

source: Greetings !username, A translation that you have submitted, has been deleted by a moderator. You can see the string and the rest of translations at this link: !url Thanks ---------- Original (English) String: !string ---------- Deleted Translation: !translation ----------
sq: Përshëndetje !username, Një përkthim që keni bërë ju, është fshirë nga një rregullator. Vargun dhe përkthimet e mbetura mund ti shihni këtu: !url Faleminderit ---------- Vargu Origjinal (Anglisht): !string ---------- Përkthimi i Fshirë: !translation ----------

source: Greetings !username, A translation that you have voted, has been deleted by a moderator. You can see the string and the rest of translations at this link: !url Thanks ---------- Original (English) String: !string ---------- Deleted Translation: !translation ----------
sq: Përshëdetje !username, Një votim i votuar nga ju është fshirë nga një rregullmbajtës. Vargun dhe pëkthimet e tjera mund ti shihni në këtë lidhje: !url Faleminderit ---------- Vargu Fillestar (Anglisht): !string ---------- Përkthimi i Fshirë: !translation ----------

source: [!prefix] Export request: !origin/!project
sq: [!prefix] Kërkesë eksportimi: !origin/!project

source: Export request by user !uid for '!origin/!project'.
sq: Kërkesë eksportimi nga përdoruesi !uid për '!origin/!project'.

source: [!prefix] Export: !project
sq: [!prefix] Eksportim: !project

source: Greetings !username, The export of '!project', that you have requested, is done. You can download it from these links: * !export_url_tgz * !export_url_diff * !export_url_ediff
sq: Përshëndetje !username, Eksporti i '!project', që keni kërkuar, është kryer. Mund ta shkarkoni nga këto lidhje: * !export_url_tgz * !export_url_diff * !export_url_ediff

source: Greetings !username, If you have time, please help to review the translation of the string at this link: !url Thanks ---------- Original (English) String: !string ---------- Available Translations:
sq: Përshëndetje !username, Nëse keni kohë, ju lutem ndihmoni për të rishikuar përkthimin e vargut te kjo lidhje: !url Faleminderit ---------- Vargu Origjinal (Anglisht): !string ---------- Përkthimet e Mundshme:

source: Export file '!filename' does not exist!
sq: Skedari i eksportit '!filename' nuk gjendet!

source: Latest translation suggestions on B-Translator
sq: Përkthimet e fundit të propozuara në B-Translator

source: Latest translation suggestions on B-Translator, for @domain
sq: Përkthimet më të fundit të sugjeruara në B-Translator, për @domain

source: You do not have enough rights for submitting votes!
sq: Nuk ke të drejta të mjaftueshme për të dhënë vota!

source: You do not have enough rights for making suggestions!
sq: Nuk ke të drejta të mjaftueshme për të bërë sugjerime!

source: You are not allowed to delete this translation!
sq: Nuk ju lejohet ta fshini këtë përkthim!

source: 1 suggestion saved
sq: 1 sugjerim u ruajt

source: 1 vote saved
sq: 1 votë u ruajt

source: 1 translation deleted
sq: 1 përkthim i fshirë

source: B-Translator Settings
sq: Rregullimet në B-Translator
